{
  "timeline.title": "Linha do Tempo: de Babbage a Hollerith",
  "timeline.subtitle": "Explore a sequência histórica.",
  "timeline.endNote": "O legado da computação continua...",
  "event.1821.title": "Máquina Diferencial — Charles Babbage",
  "event.1821.desc": "Projetada para calcular e imprimir tabelas matemáticas automaticamente. Era mecânica, com engrenagens e rodas — um passo fundamental rumo ao computador.",
  "event.1832.title": "Semyon Korsakov — Armazenamento por cartões",
  "event.1832.desc": "Utilizou cartões perfurados/registradores para organizar informações, antecipando sistemas de indexação mecânica de dados.",
  "event.1834.title": "Calculadora com teclado — Torchi",
  "event.1834.desc": "Exemplos iniciais de máquinas com entrada por teclado, facilitando inserção direta de números.",
  "event.1835.title": "Relé eletromecânico — Joseph Henry",
  "event.1835.desc": "Componentes eletromecânicos que permitiram o controle de sinais e são antecedentes dos circuitos lógicos.",
  "event.1837.title": "Máquina Analítica — Charles Babbage",
  "event.1837.desc": "Conceito de computador de uso geral: unidade aritmética, memória, controle e uso de cartões para instruções — projetada, porém não totalmente construída em sua época.",
  "event.1842.title": "Ada Lovelace — Primeiro algoritmo",
  "event.1842.desc": "Nota sobre a máquina analítica contendo um algoritmo para calcular números de Bernoulli. Reconhecida como a primeira programadora.",
  "event.1854.title": "Álgebra de Boole e lógica simbólica",
  "event.1854.desc": "Formalização da lógica por George Boole e posteriores avanços que tornaram possível tratar operações lógicas de forma algébrica — base para circuitos digitais.",
  "event.1890.title": "Máquina de Tabulação — Herman Hollerith",
  "event.1890.desc": "Usou cartões perfurados e leitores eletromecânicos para acelerar o processamento do censo dos EUA — marco da automação de dados e origem da Tabulating Machine Company (futuro IBM)."
}
